Revit 2026 API

# ConnectorElementGetLinkedConnectorElement Method

---

Get the linked connector element.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public ConnectorElement GetLinkedConnectorElement()
```
```vb
Public Function GetLinkedConnectorElement As ConnectorElement
```
```cpp
public:
ConnectorElement^ GetLinkedConnectorElement()
```
```fsharp
member GetLinkedConnectorElement : unit -> ConnectorElement
```

#### Return Value

ConnectorElement The linked connector element. If , the connector has no link.

#### Reference

ConnectorElement Class

Autodesk.Revit.DB Namespace